"""
============================
Author:丁琴
Time: 15:05
E-mail:394597923@qq.com
Company:南京瓦丁科技限公司
============================
"""
class GoodsCase:
    # 点击加号添加物品直接保存的用例
    good_errorinfo_case=[

        {"title": "选择类型没有品名", "goodsname": "", "color": "", "size": "", "expected": "品名不能为空！"},
        {"title": "有类型有品名，颜色输入尺码没有输入", "goodsname": "裤子", "color": "黑色", "size": "", "expected": "每个规格至少要有一个内容"},
        {"title": "品名超过150个字符",
         "goodsname": "裤子裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤",
         "color": "黑色", "size": "m", "expected": "品名不能超过150个字符"}
    ]
    # 什么都不输入直接保存
    good_type_errorinfo_case=[
        {"title":"什么都不填保存","goodsname":"","color":"","size":"","expected":"物品类型不能为空！"},
    ]

    # 保存成功的用例
    good_addpass_case =[
        {"title": "创建成功", "goodsname": "裤子", "color": "黑色", "size": "m", "expected": "保存成功"},
        {"title": "品名有各种字符组成", "goodsname": "裤子@ada搜索。。13", "color": "黑色", "size": "m", "expected": "保存成功"},
        {"title": "品名150个字符", "goodsname": "裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤裤裤子裤子裤子裤子裤", "color": "黑色", "size": "m", "expected": "保存成功"},

    ]

#     搜索物品
    search_goods_case =[
        {"title": "搜索物品物料号", "goodsno": "1905G022","expected": "1905G022"}
    ]
#     作废已使用的物品
    delete_exsit_case =[
        {"title": "搜索物品物料号", "goodsno": "1905G022","expected": "已使用过我物品不能作废"}
    ]
